pipeFlowReg/case5_Steady_rad_sir2_parallel/0/zoneone/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/zone1";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            fixedValue;
        value           uniform (0.006932 0 0);
    }
    zoneone_to_zonetwo
    {
        type            mappedMixed;
        field           U;              // optional field name
        value           uniform (0 0 0);
        refValue        $value;
        refGradient     uniform (0.0 0.0 0.0);
        valueFraction   uniform 1.0;
    }
    upperWall
    {
        type            noSlip;
    }
    axis
    {
        type            empty;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }

}


// ************************************************************************* //
