pipeFlowReg/case5_Steady_rad_sir2_parallel/0/zonetwo/IDefault
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      IDefault;
    location    "0";
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 0 -3 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    outlet
    {
        type            greyDiffusiveRadiation;
        T               T;
        emissivityMode  lookup;
        emissivity      uniform 0;
        absorbtivity    uniform 0;
        value		 uniform 0;
    }
    zonetwo_to_zoneone
    {
        type            mappedMixed;
        field           T;              // optional field name
        value           uniform 0;
        refValue        $value;
        refGradient     uniform 0.0;
        valueFraction   uniform 1.0;
    }
    upperWall
    {
        type            greyDiffusiveRadiation;
        T               T;
        emissivityMode  lookup;
        emissivity      uniform 1;
        absorbtivity    uniform 1;
        value		 uniform 0;
    }

    axis
    {
        type            empty;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
	   
}


// ************************************************************************* //
