pipeFlowReg/case5_Steady_rad_sir2_parallel/system/zonetwo/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 01;

vertices
(
    (2 0 0)              //1
    (5 0 0)             //2
    (5 0.25 -0.0044)    //3
    (2 0.25 -0.0044)    //4
    (5 0.25 0.0044)     //5
    (2 0.25 0.0044)     //6
    
);

blocks
(
    hex (0 1 2 3 0 1 4 5)
    (300 25 1)
    simpleGrading (1 1 1)

  
);


boundary
(
    zonetwo_to_zoneone
    {
        type mappedPatch;

        // What to sample:
        sampleMode      nearestPatchFace;

        // Simulation world to sample
        // sampleWorld     zonetwo;

        // Region to sample
        sampleRegion        zoneone;

        // If sampleMode is nearestPatchFace : patch to find faces of
        samplePatch      zoneone_to_zonetwo;

        // Use database to get data from (one-way or loose coupling in
        // combination with functionObject)
        sampleDatabase    true;
        faces
        (
            (0 3 5 0)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 4 1)
            
        );
    }
    upperWall
    {
        type wall;
        faces
        (
             (3 2 4 5)
        );
    }
    axis
    {
      type empty;
      faces
      (
           (0 1 1 0)    
      ); 
    }
    front
    {
        type wedge;
        faces
        (
            (0 1 2 3)
            
        );
    }
    back
    {
        type wedge;
        faces
        (
            (0 1 4 5)
          
        );
    }
);


// ************************************************************************* //
